; domain
(define (domain blocksworld)
  (:requirements :strips)
(:predicates (clear ?x)
             (on-table ?x)
             (arm-empty)
             (holding ?x)
             (on ?x ?y))

(:action pickup
  :parameters (?ob)
  :precondition (and (clear ?ob) (on-table ?ob) (arm-empty))
  :effect (and (holding ?ob) (not (clear ?ob)) (not (on-table ?ob))
               (not (arm-empty))))

(:action putdown
  :parameters  (?ob)
  :precondition (holding ?ob)
  :effect (and (clear ?ob) (arm-empty) (on-table ?ob)
               (not (holding ?ob))))

(:action stack
  :parameters  (?ob ?underob)
  :precondition (and (clear ?underob) (holding ?ob))
  :effect (and (arm-empty) (clear ?ob) (on ?ob ?underob)
               (not (clear ?underob)) (not (holding ?ob))))

(:action unstack
  :parameters  (?ob ?underob)
  :precondition (and (on ?ob ?underob) (clear ?ob) (arm-empty))
  :effect (and (holding ?ob) (clear ?underob)
               (not (on ?ob ?underob)) (not (clear ?ob)) (not (arm-empty)))))

; problem
;; blocks=309, out_folder=./training, instance_id=63, seed=2087, goal_proportion=0.03

(define (problem blocksworld-63)
 (:domain blocksworld)
 (:objects b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 b11 b12 b13 b14 b15 b16 b17 b18 b19 b20 b21 b22 b23 b24 b25 b26 b27 b28 b29 b30 b31 b32 b33 b34 b35 b36 b37 b38 b39 b40 b41 b42 b43 b44 b45 b46 b47 b48 b49 b50 b51 b52 b53 b54 b55 b56 b57 b58 b59 b60 b61 b62 b63 b64 b65 b66 b67 b68 b69 b70 b71 b72 b73 b74 b75 b76 b77 b78 b79 b80 b81 b82 b83 b84 b85 b86 b87 b88 b89 b90 b91 b92 b93 b94 b95 b96 b97 b98 b99 b100 b101 b102 b103 b104 b105 b106 b107 b108 b109 b110 b111 b112 b113 b114 b115 b116 b117 b118 b119 b120 b121 b122 b123 b124 b125 b126 b127 b128 b129 b130 b131 b132 b133 b134 b135 b136 b137 b138 b139 b140 b141 b142 b143 b144 b145 b146 b147 b148 b149 b150 b151 b152 b153 b154 b155 b156 b157 b158 b159 b160 b161 b162 b163 b164 b165 b166 b167 b168 b169 b170 b171 b172 b173 b174 b175 b176 b177 b178 b179 b180 b181 b182 b183 b184 b185 b186 b187 b188 b189 b190 b191 b192 b193 b194 b195 b196 b197 b198 b199 b200 b201 b202 b203 b204 b205 b206 b207 b208 b209 b210 b211 b212 b213 b214 b215 b216 b217 b218 b219 b220 b221 b222 b223 b224 b225 b226 b227 b228 b229 b230 b231 b232 b233 b234 b235 b236 b237 b238 b239 b240 b241 b242 b243 b244 b245 b246 b247 b248 b249 b250 b251 b252 b253 b254 b255 b256 b257 b258 b259 b260 b261 b262 b263 b264 b265 b266 b267 b268 b269 b270 b271 b272 b273 b274 b275 b276 b277 b278 b279 b280 b281 b282 b283 b284 b285 b286 b287 b288 b289 b290 b291 b292 b293 b294 b295 b296 b297 b298 b299 b300 b301 b302 b303 b304 b305 b306 b307 b308 b309 - object)
 (:init 
    (arm-empty)
    (clear b90)
    (on b90 b24)
    (on b24 b122)
    (on b122 b162)
    (on b162 b138)
    (on b138 b252)
    (on b252 b295)
    (on b295 b258)
    (on-table b258)
    (clear b36)
    (on b36 b89)
    (on b89 b187)
    (on b187 b119)
    (on b119 b283)
    (on b283 b139)
    (on b139 b292)
    (on-table b292)
    (clear b169)
    (on b169 b261)
    (on b261 b227)
    (on b227 b298)
    (on b298 b110)
    (on b110 b9)
    (on-table b9)
    (clear b218)
    (on-table b218)
    (clear b274)
    (on-table b274)
    (clear b186)
    (on b186 b31)
    (on-table b31)
    (clear b296)
    (on-table b296)
    (clear b27)
    (on-table b27)
    (clear b67)
    (on b67 b73)
    (on b73 b100)
    (on b100 b37)
    (on b37 b39)
    (on-table b39)
    (clear b198)
    (on b198 b3)
    (on b3 b305)
    (on b305 b294)
    (on b294 b84)
    (on b84 b300)
    (on b300 b279)
    (on b279 b26)
    (on b26 b284)
    (on b284 b185)
    (on b185 b145)
    (on-table b145)
    (clear b18)
    (on b18 b71)
    (on-table b71)
    (clear b301)
    (on b301 b290)
    (on b290 b215)
    (on b215 b273)
    (on b273 b225)
    (on b225 b133)
    (on b133 b226)
    (on b226 b174)
    (on-table b174)
    (clear b248)
    (on b248 b217)
    (on-table b217)
    (clear b177)
    (on b177 b76)
    (on-table b76)
    (clear b151)
    (on b151 b105)
    (on b105 b102)
    (on b102 b245)
    (on b245 b121)
    (on-table b121)
    (clear b224)
    (on b224 b221)
    (on b221 b166)
    (on b166 b50)
    (on b50 b204)
    (on b204 b264)
    (on b264 b94)
    (on b94 b222)
    (on b222 b103)
    (on b103 b98)
    (on b98 b79)
    (on-table b79)
    (clear b91)
    (on-table b91)
    (clear b172)
    (on b172 b244)
    (on b244 b200)
    (on b200 b247)
    (on b247 b234)
    (on b234 b178)
    (on b178 b140)
    (on b140 b150)
    (on b150 b256)
    (on-table b256)
    (clear b43)
    (on b43 b259)
    (on b259 b47)
    (on b47 b159)
    (on b159 b29)
    (on b29 b265)
    (on b265 b49)
    (on b49 b306)
    (on b306 b232)
    (on b232 b249)
    (on b249 b229)
    (on-table b229)
    (clear b175)
    (on b175 b111)
    (on b111 b262)
    (on b262 b308)
    (on b308 b155)
    (on b155 b72)
    (on b72 b257)
    (on b257 b61)
    (on b61 b278)
    (on b278 b20)
    (on b20 b230)
    (on b230 b173)
    (on b173 b163)
    (on-table b163)
    (clear b272)
    (on b272 b291)
    (on b291 b205)
    (on-table b205)
    (clear b86)
    (on b86 b152)
    (on b152 b268)
    (on b268 b16)
    (on-table b16)
    (clear b141)
    (on b141 b260)
    (on b260 b219)
    (on b219 b99)
    (on-table b99)
    (clear b286)
    (on b286 b112)
    (on-table b112)
    (clear b212)
    (on b212 b118)
    (on-table b118)
    (clear b10)
    (on b10 b65)
    (on-table b65)
    (clear b304)
    (on-table b304)
    (clear b52)
    (on-table b52)
    (clear b13)
    (on b13 b165)
    (on b165 b96)
    (on b96 b117)
    (on-table b117)
    (clear b307)
    (on b307 b263)
    (on b263 b181)
    (on b181 b201)
    (on b201 b128)
    (on-table b128)
    (clear b87)
    (on-table b87)
    (clear b213)
    (on b213 b38)
    (on b38 b137)
    (on-table b137)
    (clear b120)
    (on b120 b68)
    (on b68 b6)
    (on b6 b148)
    (on b148 b134)
    (on b134 b34)
    (on b34 b189)
    (on b189 b302)
    (on-table b302)
    (clear b242)
    (on b242 b95)
    (on b95 b116)
    (on-table b116)
    (clear b190)
    (on b190 b192)
    (on b192 b223)
    (on b223 b45)
    (on b45 b157)
    (on b157 b167)
    (on b167 b56)
    (on-table b56)
    (clear b114)
    (on-table b114)
    (clear b147)
    (on b147 b276)
    (on-table b276)
    (clear b32)
    (on b32 b5)
    (on b5 b108)
    (on b108 b7)
    (on b7 b210)
    (on b210 b60)
    (on b60 b23)
    (on b23 b207)
    (on b207 b270)
    (on-table b270)
    (clear b239)
    (on b239 b158)
    (on-table b158)
    (clear b194)
    (on b194 b131)
    (on b131 b254)
    (on-table b254)
    (clear b15)
    (on b15 b255)
    (on-table b255)
    (clear b277)
    (on-table b277)
    (clear b81)
    (on b81 b109)
    (on b109 b92)
    (on b92 b170)
    (on b170 b228)
    (on-table b228)
    (clear b171)
    (on b171 b241)
    (on b241 b197)
    (on b197 b30)
    (on-table b30)
    (clear b271)
    (on-table b271)
    (clear b59)
    (on b59 b176)
    (on b176 b40)
    (on b40 b19)
    (on b19 b285)
    (on b285 b33)
    (on-table b33)
    (clear b129)
    (on b129 b104)
    (on b104 b193)
    (on b193 b78)
    (on b78 b231)
    (on-table b231)
    (clear b64)
    (on b64 b88)
    (on b88 b17)
    (on-table b17)
    (clear b127)
    (on b127 b195)
    (on-table b195)
    (clear b132)
    (on b132 b42)
    (on-table b42)
    (clear b75)
    (on b75 b293)
    (on-table b293)
    (clear b135)
    (on b135 b83)
    (on-table b83)
    (clear b146)
    (on b146 b2)
    (on-table b2)
    (clear b297)
    (on b297 b164)
    (on-table b164)
    (clear b253)
    (on b253 b280)
    (on b280 b101)
    (on b101 b62)
    (on b62 b240)
    (on-table b240)
    (clear b143)
    (on b143 b251)
    (on b251 b266)
    (on b266 b233)
    (on b233 b22)
    (on b22 b236)
    (on b236 b14)
    (on-table b14)
    (clear b191)
    (on b191 b58)
    (on b58 b21)
    (on-table b21)
    (clear b267)
    (on-table b267)
    (clear b203)
    (on b203 b303)
    (on b303 b80)
    (on b80 b70)
    (on-table b70)
    (clear b246)
    (on b246 b214)
    (on b214 b250)
    (on b250 b238)
    (on-table b238)
    (clear b55)
    (on b55 b107)
    (on b107 b124)
    (on b124 b216)
    (on-table b216)
    (clear b106)
    (on-table b106)
    (clear b11)
    (on b11 b188)
    (on b188 b57)
    (on b57 b154)
    (on b154 b160)
    (on b160 b1)
    (on b1 b136)
    (on b136 b53)
    (on b53 b82)
    (on b82 b51)
    (on b51 b74)
    (on-table b74)
    (clear b202)
    (on b202 b93)
    (on b93 b289)
    (on b289 b144)
    (on-table b144)
    (clear b211)
    (on b211 b85)
    (on b85 b130)
    (on-table b130)
    (clear b183)
    (on b183 b126)
    (on b126 b269)
    (on-table b269)
    (clear b235)
    (on b235 b206)
    (on b206 b69)
    (on b69 b168)
    (on b168 b35)
    (on b35 b142)
    (on b142 b8)
    (on b8 b63)
    (on b63 b196)
    (on b196 b161)
    (on b161 b28)
    (on b28 b220)
    (on b220 b97)
    (on-table b97)
    (clear b182)
    (on b182 b113)
    (on b113 b209)
    (on b209 b153)
    (on b153 b123)
    (on b123 b48)
    (on-table b48)
    (clear b309)
    (on-table b309)
    (clear b275)
    (on b275 b25)
    (on b25 b179)
    (on b179 b287)
    (on b287 b12)
    (on-table b12)
    (clear b243)
    (on-table b243)
    (clear b156)
    (on b156 b149)
    (on b149 b288)
    (on b288 b199)
    (on b199 b54)
    (on-table b54)
    (clear b299)
    (on-table b299)
    (clear b180)
    (on b180 b208)
    (on b208 b41)
    (on b41 b4)
    (on-table b4)
    (clear b46)
    (on b46 b281)
    (on b281 b115)
    (on b115 b44)
    (on b44 b282)
    (on b282 b184)
    (on b184 b237)
    (on-table b237)
    (clear b77)
    (on-table b77)
    (clear b125)
    (on b125 b66)
    (on-table b66))
 (:goal  (and 
    (clear b2)
    (on-table b2)
    (clear b3)
    (on-table b3)
    (clear b5)
    (on b5 b1)
    (on b1 b6)
    (on b6 b9)
    (on b9 b7)
    (on-table b7)
    (clear b8)
    (on b8 b4)
    (on-table b4))))

; plan
1. (unstack b11 b188)
   deleted: (on b11 b188) (clear b11) (arm-empty)
   added: (holding b11) (clear b188)
   goals met: 2 of 13
2. (putdown b11)
   deleted: (holding b11)
   added: (clear b11) (arm-empty) (on-table b11)
   goals met: 2 of 13
3. (unstack b120 b68)
   deleted: (on b120 b68) (clear b120) (arm-empty)
   added: (holding b120) (clear b68)
   goals met: 2 of 13
4. (putdown b120)
   deleted: (holding b120)
   added: (clear b120) (arm-empty) (on-table b120)
   goals met: 2 of 13
5. (unstack b146 b2)
   deleted: (on b146 b2) (clear b146) (arm-empty)
   added: (holding b146) (clear b2)
   goals met: 3 of 13
6. (putdown b146)
   deleted: (holding b146)
   added: (clear b146) (arm-empty) (on-table b146)
   goals met: 3 of 13
7. (unstack b169 b261)
   deleted: (on b169 b261) (clear b169) (arm-empty)
   added: (holding b169) (clear b261)
   goals met: 3 of 13
8. (putdown b169)
   deleted: (holding b169)
   added: (clear b169) (arm-empty) (on-table b169)
   goals met: 3 of 13
9. (unstack b180 b208)
   deleted: (on b180 b208) (clear b180) (arm-empty)
   added: (holding b180) (clear b208)
   goals met: 3 of 13
10. (putdown b180)
   deleted: (holding b180)
   added: (clear b180) (arm-empty) (on-table b180)
   goals met: 3 of 13
11. (unstack b188 b57)
   deleted: (on b188 b57) (clear b188) (arm-empty)
   added: (holding b188) (clear b57)
   goals met: 3 of 13
12. (putdown b188)
   deleted: (holding b188)
   added: (clear b188) (arm-empty) (on-table b188)
   goals met: 3 of 13
13. (unstack b198 b3)
   deleted: (on b198 b3) (clear b198) (arm-empty)
   added: (holding b198) (clear b3)
   goals met: 4 of 13
14. (putdown b198)
   deleted: (holding b198)
   added: (clear b198) (arm-empty) (on-table b198)
   goals met: 4 of 13
15. (unstack b3 b305)
   deleted: (on b3 b305) (clear b3) (arm-empty)
   added: (holding b3) (clear b305)
   goals met: 3 of 13
16. (putdown b3)
   deleted: (holding b3)
   added: (clear b3) (arm-empty) (on-table b3)
   goals met: 5 of 13
17. (unstack b208 b41)
   deleted: (on b208 b41) (clear b208) (arm-empty)
   added: (holding b208) (clear b41)
   goals met: 5 of 13
18. (putdown b208)
   deleted: (holding b208)
   added: (clear b208) (arm-empty) (on-table b208)
   goals met: 5 of 13
19. (unstack b235 b206)
   deleted: (on b235 b206) (clear b235) (arm-empty)
   added: (holding b235) (clear b206)
   goals met: 5 of 13
20. (putdown b235)
   deleted: (holding b235)
   added: (clear b235) (arm-empty) (on-table b235)
   goals met: 5 of 13
21. (unstack b206 b69)
   deleted: (on b206 b69) (clear b206) (arm-empty)
   added: (holding b206) (clear b69)
   goals met: 5 of 13
22. (putdown b206)
   deleted: (holding b206)
   added: (clear b206) (arm-empty) (on-table b206)
   goals met: 5 of 13
23. (unstack b261 b227)
   deleted: (on b261 b227) (clear b261) (arm-empty)
   added: (holding b261) (clear b227)
   goals met: 5 of 13
24. (putdown b261)
   deleted: (holding b261)
   added: (clear b261) (arm-empty) (on-table b261)
   goals met: 5 of 13
25. (unstack b227 b298)
   deleted: (on b227 b298) (clear b227) (arm-empty)
   added: (holding b227) (clear b298)
   goals met: 5 of 13
26. (putdown b227)
   deleted: (holding b227)
   added: (clear b227) (arm-empty) (on-table b227)
   goals met: 5 of 13
27. (unstack b298 b110)
   deleted: (on b298 b110) (clear b298) (arm-empty)
   added: (holding b298) (clear b110)
   goals met: 5 of 13
28. (putdown b298)
   deleted: (holding b298)
   added: (clear b298) (arm-empty) (on-table b298)
   goals met: 5 of 13
29. (unstack b110 b9)
   deleted: (on b110 b9) (clear b110) (arm-empty)
   added: (holding b110) (clear b9)
   goals met: 5 of 13
30. (putdown b110)
   deleted: (holding b110)
   added: (clear b110) (arm-empty) (on-table b110)
   goals met: 5 of 13
31. (unstack b32 b5)
   deleted: (on b32 b5) (clear b32) (arm-empty)
   added: (holding b32) (clear b5)
   goals met: 6 of 13
32. (putdown b32)
   deleted: (holding b32)
   added: (clear b32) (arm-empty) (on-table b32)
   goals met: 6 of 13
33. (unstack b41 b4)
   deleted: (on b41 b4) (clear b41) (arm-empty)
   added: (holding b41) (clear b4)
   goals met: 6 of 13
34. (putdown b41)
   deleted: (holding b41)
   added: (clear b41) (arm-empty) (on-table b41)
   goals met: 6 of 13
35. (unstack b57 b154)
   deleted: (on b57 b154) (clear b57) (arm-empty)
   added: (holding b57) (clear b154)
   goals met: 6 of 13
36. (putdown b57)
   deleted: (holding b57)
   added: (clear b57) (arm-empty) (on-table b57)
   goals met: 6 of 13
37. (unstack b154 b160)
   deleted: (on b154 b160) (clear b154) (arm-empty)
   added: (holding b154) (clear b160)
   goals met: 6 of 13
38. (putdown b154)
   deleted: (holding b154)
   added: (clear b154) (arm-empty) (on-table b154)
   goals met: 6 of 13
39. (unstack b160 b1)
   deleted: (on b160 b1) (clear b160) (arm-empty)
   added: (holding b160) (clear b1)
   goals met: 6 of 13
40. (putdown b160)
   deleted: (holding b160)
   added: (clear b160) (arm-empty) (on-table b160)
   goals met: 6 of 13
41. (unstack b68 b6)
   deleted: (on b68 b6) (clear b68) (arm-empty)
   added: (holding b68) (clear b6)
   goals met: 6 of 13
42. (putdown b68)
   deleted: (holding b68)
   added: (clear b68) (arm-empty) (on-table b68)
   goals met: 6 of 13
43. (unstack b69 b168)
   deleted: (on b69 b168) (clear b69) (arm-empty)
   added: (holding b69) (clear b168)
   goals met: 6 of 13
44. (putdown b69)
   deleted: (holding b69)
   added: (clear b69) (arm-empty) (on-table b69)
   goals met: 6 of 13
45. (unstack b168 b35)
   deleted: (on b168 b35) (clear b168) (arm-empty)
   added: (holding b168) (clear b35)
   goals met: 6 of 13
46. (putdown b168)
   deleted: (holding b168)
   added: (clear b168) (arm-empty) (on-table b168)
   goals met: 6 of 13
47. (unstack b35 b142)
   deleted: (on b35 b142) (clear b35) (arm-empty)
   added: (holding b35) (clear b142)
   goals met: 6 of 13
48. (putdown b35)
   deleted: (holding b35)
   added: (clear b35) (arm-empty) (on-table b35)
   goals met: 6 of 13
49. (unstack b142 b8)
   deleted: (on b142 b8) (clear b142) (arm-empty)
   added: (holding b142) (clear b8)
   goals met: 7 of 13
50. (putdown b142)
   deleted: (holding b142)
   added: (clear b142) (arm-empty) (on-table b142)
   goals met: 7 of 13
51. (unstack b5 b108)
   deleted: (on b5 b108) (clear b5) (arm-empty)
   added: (holding b5) (clear b108)
   goals met: 6 of 13
52. (stack b5 b1)
   deleted: (clear b1) (holding b5)
   added: (arm-empty) (clear b5) (on b5 b1)
   goals met: 8 of 13
53. (unstack b108 b7)
   deleted: (on b108 b7) (clear b108) (arm-empty)
   added: (holding b108) (clear b7)
   goals met: 8 of 13
54. (putdown b108)
   deleted: (holding b108)
   added: (clear b108) (arm-empty) (on-table b108)
   goals met: 8 of 13
55. (unstack b7 b210)
   deleted: (on b7 b210) (clear b7) (arm-empty)
   added: (holding b7) (clear b210)
   goals met: 8 of 13
56. (putdown b7)
   deleted: (holding b7)
   added: (clear b7) (arm-empty) (on-table b7)
   goals met: 9 of 13
57. (unstack b6 b148)
   deleted: (on b6 b148) (clear b6) (arm-empty)
   added: (holding b6) (clear b148)
   goals met: 9 of 13
58. (stack b6 b9)
   deleted: (clear b9) (holding b6)
   added: (arm-empty) (clear b6) (on b6 b9)
   goals met: 10 of 13
59. (unstack b8 b63)
   deleted: (on b8 b63) (clear b8) (arm-empty)
   added: (holding b8) (clear b63)
   goals met: 9 of 13
60. (stack b8 b4)
   deleted: (clear b4) (holding b8)
   added: (arm-empty) (clear b8) (on b8 b4)
   goals met: 11 of 13
61. (unstack b6 b9)
   deleted: (on b6 b9) (clear b6) (arm-empty)
   added: (holding b6) (clear b9)
   goals met: 10 of 13
62. (putdown b6)
   deleted: (holding b6)
   added: (clear b6) (arm-empty) (on-table b6)
   goals met: 10 of 13
63. (pickup b9)
   deleted: (clear b9) (on-table b9) (arm-empty)
   added: (holding b9)
   goals met: 10 of 13
64. (stack b9 b7)
   deleted: (clear b7) (holding b9)
   added: (arm-empty) (clear b9) (on b9 b7)
   goals met: 11 of 13
65. (pickup b6)
   deleted: (clear b6) (on-table b6) (arm-empty)
   added: (holding b6)
   goals met: 11 of 13
66. (stack b6 b9)
   deleted: (clear b9) (holding b6)
   added: (arm-empty) (clear b6) (on b6 b9)
   goals met: 12 of 13
67. (unstack b5 b1)
   deleted: (on b5 b1) (clear b5) (arm-empty)
   added: (holding b5) (clear b1)
   goals met: 10 of 13
68. (putdown b5)
   deleted: (holding b5)
   added: (clear b5) (arm-empty) (on-table b5)
   goals met: 11 of 13
69. (unstack b1 b136)
   deleted: (on b1 b136) (clear b1) (arm-empty)
   added: (holding b1) (clear b136)
   goals met: 11 of 13
70. (stack b1 b6)
   deleted: (clear b6) (holding b1)
   added: (arm-empty) (clear b1) (on b1 b6)
   goals met: 12 of 13
71. (pickup b5)
   deleted: (clear b5) (on-table b5) (arm-empty)
   added: (holding b5)
   goals met: 11 of 13
72. (stack b5 b1)
   deleted: (clear b1) (holding b5)
   added: (arm-empty) (clear b5) (on b5 b1)
   goals met: 13 of 13
